void main() {
  List num = [1, 4, 2, 7];
  var Sum = 0;
  for (int n in num) {
    Sum += n;
  }
  print(Sum);
}
// ## تمرين 1

// اكتب برنامج يقوم بجمع القيم الموجوده في داخل ال List

// خطوات التمرين :

// 1. عين List بالقيم التالية : [1, 4, 2, 7]
// 2. قيم بأنشاء متغير sum وقيمته الابتدائية 0
// 3. قم بأستخدام for loop بحيث تقوم بقرائة القيم الموجوده في List
// 4. وعند كل قيمة قم بالتعديل على قيمة المتغير sum
// 5. قم بطباعة المجموع

// \*Output

// ``` 
// 7 + 2 + 4 + 1
// المجموع: 14
// ```

// ---